load-tests/black-friday-test.yml
config:
  target: "http://localhost:9000"
  phases:
    - duration: 300
      arrivalRate: 10
      name: Normal traffic
    - duration: 60
      arrivalRate: 100
      name: Black Friday spike
    - duration: 120
      arrivalRate: 80
      name: Sustained high load
    - duration: 60
      arrivalRate: 20
      name: Recovery phase
  defaults:
    headers:
      Content-Type: "application/json"
scenarios:
  - name: "Black Friday shopping frenzy"
    weight: 50
    flow:
      - get:
          url: "/store/products?limit=50"
          expect:
            - statusCode: 200
      - think: 2
      - get:
          url: "/store/products/{{ $randomInt(1, 100) }}"
      - think: 1
      - post:
          url: "/store/carts"
          json:
            region_id: "reg_01HXXXXXXXXXXXXXXXXXXXXX"
          capture:
            json: "$.cart.id"
            as: "cart_id"
      - loop:
          - post:
              url: "/store/carts/{{ cart_id }}/line-items"
              json:
                variant_id: "variant_{{ $randomInt(1, 50) }}"
                quantity: { { $randomInt(1, 3) } }
        count: { { $randomInt(1, 5) } }
      - post:
          url: "/store/carts/{{ cart_id }}/complete"
          json:
            billing_address:
              first_name: "Test{{ $randomInt(1, 1000) }}"
              last_name: "User{{ $randomInt(1, 1000) }}"
              address_1: "{{ $randomInt(1, 999) }} Test St"
              city: "Test City"
              country_code: "US"
              postal_code: "{{ $randomInt(10000, 99999) }}"
            email: "test{{ $randomInt(1, 1000) }}@example.com"
          expect:
            - statusCode: 200
  - name: "Product browsing"
    weight: 30
    flow:
      - get:
          url: "/store/products?category=black-friday-deals"
      - think: 3
      - get:
          url: "/store/products?price_list=discounted"
      - think: 2
      - get:
          url: "/store/products/{{ $randomInt(1, 100) }}"
  - name: "Cart abandonment"
    weight: 20
    flow:
      - post:
          url: "/store/carts"
          json:
            region_id: "reg_01HXXXXXXXXXXXXXXXXXXXXX"
          capture:
            json: "$.cart.id"
            as: "cart_id"
      - post:
          url: "/store/carts/{{ cart_id }}/line-items"
          json:
            variant_id: "variant_{{ $randomInt(1, 50) }}"
            quantity: 1
      - think: 10